app/controllers/beers_controller.rb

  def index
    @user = User.find_by(id: @current_user.id)
    save_fetch_beers
    render_beers = Beer.all.where(user_id: @user.id).order(favorite: :desc).map do |beer|
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "beers".* FROM "beers" WHERE "beers"."user_id" = $1 ORDER BY "beers"."favorite" DESC  [["user_id", 1]]

  def save_favorite
    @beer = Beer.find_by(name: params[:name])
    if Favorite.favorite?(@beer)
      render json: {
        "notice": "Beer is already a favorite"
      }
    else
      @beer.favorite = true
      @beer.save
---
SELECT  "beers".* FROM "beers" WHERE "beers"."name" = $1 LIMIT $2  [["name", "Buzz"], ["LIMIT", 1]]
UPDATE "beers" SET "favorite" = $1 WHERE "beers"."id" = $2  [["favorite", true], ["id", 51]]

  def save_fetch_beers
    response = get_beer_list
    body = JSON.parse(response.body)
    beers = beer_info(body)

    beers.each do |beer|
      @user = User.find_by(id: @current_user.id)
      check_beer = Beer.where(user_id: @user.id).find_by(name: beer[:name])
      next if check_beer && check_beer.user.id == @user.id

      @beer = @user.beers.build(name: beer[:name],
                                description: beer[:description],
                                tagline: beer[:tagline],
                                abv: beer[:abv],
                                seen_at: DateTime.now)

      next unless @beer.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "beers".* FROM "beers" WHERE "beers"."user_id" = $1 AND "beers"."name" = $2 LIMIT $3  [["user_id", 1], ["name", "AB:08"], ["LIMIT", 1]]
INSERT INTO "beers" ("name", "description", "tagline", "abv", "user_id", "seen_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def fav_beers_list
    @fav_beers = []
    @user = User.find_by(id: @current_user.id)
    @favorite_beers = @user.beers.where(favorite: true).each do |fav|
        @fav_beers << fav
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "beers".* FROM "beers" WHERE "beers"."user_id" = $1 AND "beers"."favorite" = $2  [["user_id", 1], ["favorite", true]]
INSERT INTO "beers" ("name", "description", "tagline", "abv", "user_id", "seen_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"